// 种族
const RaceMaps = {
  "XHZY": "猩红之月",
  "TSHEN": '天神',
  "LHLHYY": '灵魂莲华夜幽',
  "YJX": '玉剑仙',
  "YHZS": '永恒之森',
  "LR": '浪人',
  "FX": '福星',
  "YS": '月神',
  "RZ": '忍者',
  "LHLHMZ": '灵魂莲华明昼',
  "SGMJ": '三国猛将',
  "BW": '霸王',
  "TSHA": '天煞',
}
const RaceInfos = {
  [RaceMaps.XHZY]: {
    description: '一旦你的队伍失去了50%总生命值，加里奥就会被召唤出来，砸向敌人最密集的位置，并将大范围内的敌人击飞。',
    effect: {
      3: "(3)暴君加里奥",
      6: "(6)魔王加里奥",
      9: "(9)至尊魔神加里奥"
    }
  },

  [RaceMaps.TSHEN]: {
    description: '在攻击6次或生命值跌到50%以下后，天神们就会飞升，获得25%伤害减免，并造成额外真实伤害。',
    effect: {
      2: "(2)20%",
      4: "(4)40%",
      6: "(6)65%",
      8: "(8)100%",
    }
  },
  [RaceMaps.LHLHYY]: {
    description: '夜幽们会提升所有友军的法强加成，自身获得额外法强。',
    effect: {
      2: "(2)提升友军20%法强",
      4: "(4)提升友军20%法强，自身再获得额外40%法强",
      6: "(6)提升友军50%法强，自身再获得额外100%法强",
    }
  },
  [RaceMaps.YJX]: {
    description: '玉剑仙们获得额外的法力生成',
    effect: {
      2: "(2)+50%法力值生成",
      4: "(4)+75%法力值生成",
      6: "(6)+100%法力值生成",
    }
  },
  [RaceMaps.YHZS]: {
    description: '每过2秒，所有永恒之森的英雄们就会获得额外属性成长。这个效果至多可叠加5次。',
    effect: {
      3: "(3)20护甲和魔抗、5攻击力和法强",
      6: "(6)35双抗、10攻击力和法强",
      9: "(9)60双抗，25攻击力和法强",
    }
  },
  [RaceMaps.LR]: {
    description: '战斗开始时，如果一名浪人英雄的邻格没有任何友军，那么他会获得: ',
    effect: {
      1: "(1)一层相当于其50%最大生命值的护盾",
      2: "(2)一层相当于其50%最大生命值的护盾，以及100%生命偷取"
    }
  },
  [RaceMaps.FX]: {
    description: '在赢下一场对抗玩家的战斗后，会获得额外的战利品法球。你没有获得法球的时间越久，额外掉落的战利品法球就会越丰厚。',
    effect: {}
  },
  [RaceMaps.YS]: {
    description: ' (3)在战斗开始时，星级最低的月神单位会提升1个星级，持续至本回合战斗结束。如果有多个人选，那么会选择带有最多装备的单位(可升级为4星)。',
    effect: {
      3:''
    }
  },
  [RaceMaps.RZ]: {
    description: '忍者们获得额外的攻击力和法强。',
    effect: {
      1:'(仅1)45攻击力和法强',
      4:'(仅4)90攻击力和法强'
    }
  },
  [RaceMaps.LHLHMZ]: {
    description: '一名明昼单位在首次施放技能时，会为所有友军提供攻速加成。',
    effect: {
      2:'(2)提供相当于35%法力消耗的攻速',
      4:'(4)提供相当于90%法力消耗的攻速'
    }
  },
  [RaceMaps.SGMJ]: {
    description: '三国猛将们获得额外的生命值和法术强度加成。他们在登场后每打赢一场战斗，就会使这个额外加成效果提升10%，至多可叠加5次。(*羁绊没凑出来时的上场也可以累积胜场。)',
    effect: {
      3:'(3) 200生命值和20法强',
      6:'(6) 400生命值和40法术强度',
      9:'(9) 700生命值和70法强'
    }
  },
  [RaceMaps.BW]: {
    description: '当霸王首次降到40%生命值时，他会将自已移出战斗并开始做仰卧起坐。每次仰卧起坐回复15%生命值并为他提供20%攻速。\n'+
      '>如果他达到满血则会带着斗志满满效果重返战斗，则他的普通攻击和技能伤害都会转化为真实伤害;\n' +
      '>如果所有友军都阵亡了，那么他会立刻提前重返战斗。',
    effect: {
      1:''
    }
  },
  [RaceMaps.TSHA]: {
    description: '天煞在参与3次战斗后，可选择转换为其它形态。\n'+
      '>暗裔:基于造成伤害的80%，回复自身的生命值;\n' +
      '>影子:造成基于目标5/10/20%最大生命值的额外伤害。',
    effect: {
      1:''
    }
  },
}
