// 特质
const TraitsMaps = {
  "XHZY": "猩红之月",
  "TSHEN": '天神',
  "LHLHYY": '灵魂莲华夜幽',
  "YJX": '玉剑仙',
  "YHZS": '永恒之森',
  "LR": '浪人',
  "FX": '福星',
  "YS": '月神',
  "RZ": '忍者',
  "LHLHMZ": '灵魂莲华明昼',
  "SGMJ": '三国猛将',
  "BW": '霸王',
  "TSHA": '天煞',
}
const TraitsInfos = {
  [TraitsMaps.XHZY]: {
    description: '一旦你的队伍失去了50%总生命值，加里奥就会被召唤出来，砸向敌人最密集的位置，并将大范围内的敌人击飞。',
    effect: {
      3: "(3)暴君加里奥",
      6: "(6)魔王加里奥",
      9: "(9)至尊魔神加里奥"
    }
  },

  [TraitsMaps.TSHEN]: {
    description: '在攻击6次或生命值跌到50%以下后，天神们就会飞升，获得25%伤害减免，并造成额外真实伤害。',
    effect: {
      2: "(2)20%",
      4: "(4)40%",
      6: "(6)65%",
      8: "(8)100%",
    }
  },


  [TraitsMaps.TSHEN]: {
    description: '在攻击6次或生命值跌到50%以下后，天神们就会飞升，获得25%伤害减免，并造成额外真实伤害。',
    effect: {
      2: "(2)20%",
      4: "(4)40%",
      6: "(6)65%",
      8: "(8)100%",
    }
  },
}
